app/Controllers/Auth.php

    public function verifyemail()
{
    $db = \Config\Database::connect();
    $builder = $db->table('users');

    if($this->request->getGet('token'))
    {
        $token = $this->request->getGet('token');
        $builder->where('verify_token', $token);
        $query = $builder->get();

        if ($query->getNumRows() > 0)
        {
            $row = $query->getRow();

            if ($row->verify_status == "0")
            {
                $builder->set('verify_status', '1');
                $builder->where('verify_token', $row->verify_token);
                $builder->update();
---
SELECT *
FROM `users`
WHERE `verify_token` = '7a039305900c7168c86d09201e76a19b'
UPDATE `users` SET `verify_status` = '1'
WHERE `verify_token` = '7a039305900c7168c86d09201e76a19b'

            ];

            $usersModel = new \App\Models\UsersModel();
            $query = $usersModel->insert($values);
---
INSERT INTO `users` (`name`, `email`, `password`, `verify_token`) VALUES ('Vanessa Cyrilla', 'vanessa.cyrilla@strathmore.edu', '12341234#', '1fe284843de0f5146d6d36055c2d9c54')

        function check(){

            $validation = $this->validate([
                'email'=>[
                    'rules'=>'required|valid_email|is_not_unique[users.email]',
                    'errors'=>[
                        'required'=>'Email is required',
                        'valid_email'=>'Enter a valid email address',
                        'is_not_unique'=>'This email is not registered'
                    ]
                    ],
                    'password'=>[
                    'rules'=>'required|min_length[8]|max_length[12]',
                    'errors'=>[
                        'required'=>'Password is required',
                        'min_length'=>'Password must have at least 8 characters',
                        'max_length'=>'Password must not exceed 12 characters'
                    ]
                    ]
                ]);

            if(!$validation){
                return view ('auth/login',['validation'=> $this->validator]);
            }else {

                $email = $this->request->getPost('email');
                $password = $this->request->getPost('password');
                $usersModel = new \App\Models\UsersModel();
                $user_info = $usersModel-> where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'vanessa.cyrilla@strathmore.edu'
 LIMIT 1