app/Controllers/Auth.php

    public function verifyemail()
{
    $db = \Config\Database::connect();
    $builder = $db->table('patients');

    if($this->request->getGet('token'))
    {
        $token = $this->request->getGet('token');
        $builder->where('verify_token', $token);
        $query = $builder->get();

        if ($query->getNumRows() > 0)
        {
            $row = $query->getRow();

            if ($row->verify_status == "0")
            {
                $builder->set('verify_status', '1');
                $builder->where('verify_token', $row->verify_token);
                $builder->update();
---
SELECT *
FROM `patients`
WHERE `verify_token` = '4e7adf5e96694613f80813857c6c8263'
UPDATE `patients` SET `verify_status` = '1'
WHERE `verify_token` = '4e7adf5e96694613f80813857c6c8263'

            ];

            $patientsModel = new \App\Models\PatientsModel();
            $query = $patientsModel->insert($values);
---
INSERT INTO `patients` (`name`, `email`, `password`, `verify_token`) VALUES ('Vanessa Cyrilla', 'vanessa.cyrilla@strathmore.edu', '12341234#', '4e7adf5e96694613f80813857c6c8263')