app/Controllers/Dashboard.php

    public function index()
    {
        $usersModel = new \App\Models\UsersModel();
        $loggeduserID = session()->get('loggedUser');
        $userInfo = $usersModel ->find($loggeduserID);
---
SELECT *
FROM `users`
WHERE `users`.`userID` = '39'