app/Controllers/DoctorController.php

UPDATE `users` SET `name` = 'Test Doctor 5x', `email` = 'testdoctor5@gmail.com', `specialisation` = 'General', `role` = 'doctor'
WHERE `users`.`userID` IN ('49')
---
    public function update($userID)
    {
        $doctor = new DoctorsModel();
        $doctor->find($userID);
        $data =[
            'name'=> $this->request->getPost('name'),
            'email'=> $this->request->getPost('email'),
            'specialisation'=> $this->request->getPost('specialisation'),
            'role'=> 'doctor'

        ];
        $doctor->update($userID, $data);

DELETE FROM `users`
WHERE `userID` IN ('49')
---
    public function delete($userID)
    {
        $doctor= new DoctorsModel();
        $doctor->delete($userID);